In [23]:
import pandas as pd

0      John
1     Teemo
2    Gerard
dtype: object
Honda Civic     2000
Toyota Supra    1999
Ford Mustang    2006
dtype: int64
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Brand   3 non-null      object
 1   Model   3 non-null      object
 2   Year    3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes
              Year
count     3.000000
mean   2001.333333
std       4.163332
min    1998.000000
25%    1999.000000
50%    2000.000000
75%    2003.000000
max    2006.000000

   Brand    Model  Year
1  Honda    Civic  2000
2   Ford  Mustang  2006